  let str = "全部地域 9999999  北京 1000  上海 2000  天津 3000  广东 4000  福建 5000  海南 8000  安徽 9000  贵州 10000  甘肃 11000  广西 12000  河北 13000  河南 14000  黑龙江 15000  湖北 16000  湖南 17000  吉林 18000  江苏 19000  江西 20000  辽宁 21000  内蒙古 22000  宁夏 23000  青海 24000  山东 25000  山西 26000  陕西 27000  四川 28000  西藏 29000  新疆 30000  云南 31000  浙江 32000  重庆 33000  香港 34000  台湾 35000  澳门 36000  日本 200000  其他国家（除日本外） 300000  潮州 4085  东莞 4116  佛山 4090  广州 4084  河源 4115  惠州 4117  江门 4082  揭阳 4083  茂名 4086  梅州 4088  清远 4089  汕头 4091  汕尾 4092  韶关 4094  深圳 4093  阳江 4109  云浮 4111  湛江 4110  肇庆 4114  中山 4112  珠海 4113  福州 5081  龙岩 5050  南平 5049  宁德 5051  莆田 5048  泉州 5052  三明 5066  厦门 5070  漳州 5080  白沙黎族自治县 8493  保亭黎族苗族自治县 8488  昌江黎族自治县 8492  澄迈县 8487  儋州 8303  定安县 8484  东方 8296  海口 8302  乐东黎族自治县 8490  临高县 8491  陵水黎族自治县 8486  琼海 8297  琼中黎族苗族自治县 8489  三亚 8298  屯昌县 8485  万宁 8301  文昌 8299  五指山 8300  安庆 9128  蚌埠 9141  亳州 9143  巢湖 9129  池州 9130  滁州 9131  阜阳 9140  合肥 9142  淮北 9127  淮南 9133  黄山 9132  六安 9135  马鞍山 9134  铜陵 9138  芜湖 9139  宿州 9137  宣城 9136  安顺 10119  毕节 10124  贵阳 10118  六盘水 10120  黔东南 10122  黔南 10121  黔西南 10123  铜仁 10125  遵义 10126  白银 11267  定西 11263  甘南 11477  嘉峪关 11257  金昌 11256  酒泉 11255  兰州 11258  临夏 11261  陇南 11259  平凉 11260  庆阳 11262  天水 11265  武威 11264  张掖 11266  百色 12108  北海 12104  崇左 12478  防城港 12098  贵港 12096  桂林 12095  河池 12106  贺州 12107  来宾 12100  柳州 12101  南宁 12099  钦州 12102  梧州 12103  玉林 12105  保定 13304  沧州 13305  承德 13306  邯郸 13330  衡水 13332  廊坊 13307  秦皇岛 13325  石家庄 13327  唐山 13329  邢台 13326  张家口 13331  安阳 14309  鹤壁 14323  济源 14476  焦作 14308  开封 14310  洛阳 14311  漯河 14312  南阳 14315  平顶山 14313  濮阳 14316  三门峡 14321  商丘 14320  新乡 14317  信阳 14318  许昌 14319  郑州 14322  周口 14324  驻马店 14314  大庆 15342  大兴安岭 15343  哈尔滨 15335  鹤岗 15344  黑河 15345  鸡西 15333  佳木斯 15334  牡丹江 15336  七台河 15338  齐齐哈尔 15337  双鸭山 15340  绥化 15339  伊春 15341  鄂州 16377  恩施 16366  黄冈 16349  黄石 16348  荆门 16346  荆州 16347  潜江 16364  神农架 16368  十堰 16369  随州 16367  天门 16373  武汉 16371  仙桃 16372  咸宁 16375  襄阳 16370  孝感 16365  宜昌 16376  常德 17351  郴州 17353  衡阳 17360  怀化 17350  娄底 17354  邵阳 17355  湘潭 17356  湘西 17357  益阳 17359  永州 17362  岳阳 17361  张家界 17358  长沙 17352  株洲 17363  白城 18039  白山 18042  吉林 18038  辽源 18041  四平 18043  松原 18044  通化 18045  延边 18047  长春 18040  常州 19054  淮安 19053  连云港 19057  南京 19055  南通 19056  苏州 19059  泰州 19061  无锡 19062  宿迁 19060  徐州 19058  盐城 19063  扬州 19064  镇江 19065  抚州 20078  赣州 20077  吉安 20068  景德镇 20069  九江 20067  南昌 20072  萍乡 20071  上饶 20074  新余 20073  宜春 20075  鹰潭 20076  鞍山 21151  本溪 21145  朝阳 21147  大连 21155  丹东 21144  抚顺 21152  阜新 21150  葫芦岛 21157  锦州 21146  辽阳 21148  盘锦 21149  沈阳 21153  铁岭 21154  营口 21156  阿拉善盟 22159  巴彦淖尔 22162  包头 22169  赤峰 22158  鄂尔多斯 22168  呼和浩特 22167  呼伦贝尔 22166  通辽 22161  乌海 22164  乌兰察布 22163  锡林郭勒盟 22165  兴安盟 22160  固原 23170  石嘴山 23171  吴忠 23172  银川 23174  中卫 23173  果洛 24496  海北 24494  海东 24176  海南 24479  海西 24177  黄南 24495  西宁 24175  玉树 24178  滨州 25223  德州 25200  东营 25220  菏泽 25222  济南 25196  济宁 25197  莱芜 25198  聊城 25199  临沂 25201  青岛 25202  日照 25203  泰安 25208  威海 25218  潍坊 25204  烟台 25219  枣庄 25221  淄博 25207  大同 26217  晋城 26205  晋中 26206  临汾 26211  吕梁 26210  朔州 26213  太原 26214  忻州 26212  阳泉 26215  运城 26216  长治 26209  安康 27240  宝鸡 27239  汉中 27248  商洛 27241  铜川 27242  渭南 27243  西安 27244  咸阳 27245  延安 27246  榆林 27249  阿坝 28252  巴中 28247  成都 28226  达州 28250  德阳 28232  甘孜 28236  广安 28224  广元 28225  乐山 28233  凉山 28228  泸州 28234  眉山 28227  绵阳 28229  南充 28231  内江 28235  攀枝花 28230  遂宁 28237  雅安 28251  宜宾 28254  资阳 28238  自贡 28253  阿里 29498  昌都 29480  拉萨 29269  林芝 29270  那曲 29268  日喀则 29271  山南 29497  阿克苏 30185  阿拉尔 30499  阿勒泰 30182  巴音郭楞 30191  博尔塔拉 30180  昌吉 30181  哈密 30179  和田 30195  喀什 30183  克拉玛依 30184  克孜勒苏柯尔克孜 30186  石河子 30187  塔城 30188  图木舒克 30500  吐鲁番 30190  乌鲁木齐 30192  五家渠 30189  伊犁 30193  保山 31289  楚雄 31283  大理 31292  德宏 31286  迪庆 31482  红河 31293  昆明 31284  丽江 31285  临沧 31287  怒江 31481  普洱 31290  曲靖 31288  文山 31291  西双版纳 31483  玉溪 31295  昭通 31294  杭州 32280  湖州 32282  嘉兴 32273  金华 32272  丽水 32275  宁波 32276  衢州 32274  绍兴 32277  台州 32279  温州 32278  舟山 32281 ";
  let phrase = /[\u4e00-\u9fa5|\uff08|\uff09]+.?\d+/g
  let long = str.match(phrase)
  let region = long.map((item)=>{
        return item.split(/\s+/)
  })
  region = region.map((item)=>{
    item[1]=~~item[1]
    return item
  }).sort((a,b)=>{
    return a[1]-b[1]
   })

//    let tree =[{
//         countryName:"中国",
//         code:"100000",
//         province:[{
//             provinceName:"",
//             code:"",
//             city:[{

//             },

//             ]
//         },

//         ]
//    },{
//         countryName:"日本",
//         code:"200000",
//    },{
//         countryName:"其他国家（除日本外）",
//         code:"300000"
//    }]
export default region;