let str = "教育 50 学前教育 5000 0-3岁训练 500001 3-6岁训练 500002 中小学教育 5001 小学辅导 500101 初中辅导 500102 高中辅导 500103 学历教育 5002 专升本 500201 自考 500202 成人高考 500203 考研 500204 在职MBA 500205 出国留学 5003 雅思/托福 500301 留学入学考试 500302 美国高考 500303 留学申请 500304 国际游学 500305 语言培训 5004 少儿英语 500401 青少年英语 500402 四六级英语考试 500403 成人英语 500404 其他小语种 500405 职业技能培训 5005 IT培训与考试 500501 公务员培训与考试 500502 财经考试 500503 医学资格培训与考试 500504 教师资格考试 500505 建造师资格考试 500506 厨师培训 500507 文艺培训 5006 体能培训 5007 家教 5008 房产 51 房产中介 5100 二手房交易 510001 新房交易 510002 豪宅交易 510003 写字楼交易 510004 海外房产交易 510005 住宅租赁 510006 商业租赁 510007 房屋装修 5102 别墅装修 510201 小户型装修 510202 装修建材 510203 游戏 52 游戏（按题材） 5201 西游 520101 战争 520102 传奇 520103 历史 520104 仙侠 520105 小说 520106 二次元 520107 西方魔幻 520108 三国 520109 游戏（按类型） 5202 休闲益智 520201 体育竞技 520202 动作 520203 卡牌 520204 在线棋牌 520205 射击 520206 角色扮演 520207 经营养成 520208 酷跑竞速 520209 模拟辅助 520210 宝石消除 520211 儿童游戏 520212 策略塔防 520213 格斗 520214 游戏（按开发商） 5203 腾讯 520301 网易 520302 完美世界 520303 宝果科技 520304 搜狐畅游 520305 360 520306 3975 520307 诚品软件 520308 游戏（按载体） 5204 PC游戏 520401 手机游侠 520402 游戏机 520403 网页游戏 520404 网络游戏 520405 汽车 53 汽车（按类型） 5301 MPV 530101 SUV 530102 轿车 530103 皮卡 530104 汽车（按动力） 5302 汽油 530201 新能源 530202 汽车（按价格） 5303 低档车 530301 中档车 530302 高档车 530303 豪华车 530304 汽车服务 5304 汽车保险 530401 汽车改装 530402 汽车用品 530403 汽车维修 530404 汽车美容 530405 租车服务 5305 汽车商品 5306 二手汽车 5307 车展 5308 金融 54 银行 5401 贷款 540101 信用卡 540102 理财 540103 保险 5402 财险 540201 寿险 540202 疾病保险 540203 证券 5403 期货 540301 股票 540302 基金 540303 债券 540304 贵金属 540305 外汇 540306 信托 5404 彩票 5405 旅游 55 国内游 5501 境外游 5502 交通票务 5503 飞机票 550301 火车票 550302 大巴票 550303 游轮票 550304 景点票务 5504 酒店住宿 5505 高端酒店 550501 中端酒店 550502 经济酒店 550503 签证 5506 主题旅游 5507 自驾游 5508 本地周边游 5509 户外探险 5510 招商加盟 56 教育网络加盟 5601 食品保健品加盟 5602 酒水饮料加盟 5603 美容保健加盟 5604 生活服务加盟 5605 机械加盟 5606 家居建材加盟 5607 数码家电加盟 5608 教育培训加盟 5609 服装加盟 5610 干洗加盟 5611 餐饮加盟 5612 购物 57 数码家电 5701 办公设备 570101 手机通讯 570102 电脑整机 570103 电脑配件 570104 摄影设备 570105 手机配件 570106 网络设备 570107 影音设备 570108 厨房电器 570109 大家电 570110 个人护理电器 570111 服饰箱包 5702 时尚女装 570201 精品男装 570202 女鞋 570203 男鞋 570204 内衣 570205 珠宝配饰 570206 箱包皮具 570207 手表 570208 家具 5703 日用百货 570301 厨具餐具 570302 家具（+办公家具） 570305 家纺 570306 灯具 570307 生鲜 5704 水果 570401 蔬菜 570402 肉品 570403 水产 570404 母婴亲子 58 母婴食品 5801 奶粉 580101 辅食 580102 母婴护理 5802 孕婴保健 580201 母婴护理服务 580202 纸尿裤湿巾 580203 产后护理 580204 宝宝护洗用户 580205 宝宝家电 580206 宝宝安全 580207 宝宝玩乐 580208 妈妈用品 580209 胎教 580210 儿童用品 5803 童装童鞋 580301 童车童床 580302 儿童摄影 580303 儿童玩具 580304 母婴社区 5804 备孕 5805 医疗健康 59 养生保健 5901 医疗器械 5902 医疗服务 5903 医疗机构 5904 疾病 5906 药品 5907 体检 5908 疗养院 5909 成人用品 5910 口腔健康 5911 餐饮美食 60 美食 6001 面包蛋糕 600101 休闲小食 600102 快餐 600103 火锅 600104 烧烤 600105 海鲜 600106 酒水 6002 饮料 6003 烹饪和菜谱 6004 商务服务 61 人员招聘 6101 会计审计 6102 公关服务 6103 安全安保 6104 广告服务 6105 法律咨询 6106 大宗货物物流 6107 移民中介 6108 机械器材 6110 农林牧渔 6111 生活服务 62 二手回收 6201 婚恋交友 6202 婚庆服务 6203 家政服务 6204 月嫂 620401 保姆 620402 保洁 620403 搬家服务 620404 摄影服务 6205 物业维修 6206 物流配送 6207 礼品鲜花 6208 个护美容 63 减肥瘦身 6301 整容整形 6302 护肤美妆 6303 彩妆 630301 护肤品 630302 个人护理 6304 美发 630401 美甲 630402 SPA美体 630403 香水 6305 软件应用 64 办公学习 6401 系统工具 6402 社交通讯 6403 影音图像 6404 手机美化 6405 理财购物 6406 生活实用 6407 资讯阅读 6408 旅游出行 6409 母婴育儿 6410 应用市场 6411 文化娱乐 65 动漫 6501 热血动漫 650101 动漫资讯 650102 国产动漫 650103 韩国动漫 650104 欧美动漫 650105 日本动漫 650106 影视 6502 爱情 650201 家庭 650202 动作 650203 犯罪 650204 中国近代战争 650205 搞笑 650206 武侠 650207 广播电台 6503 戏曲曲艺 6504 演出票务 6505 直播 6506 星娱 650601 游戏直播 650602 音乐直播 650603 综艺 6507 音乐 6508 KTV 6509 棋牌桌游 6510 收藏 6511 文化艺术 6512 书籍阅读 6513 星座运势 6514 休闲爱好 6515 网络小说 6516 资讯 66 社会时政 6601 法制 6602 国际社会 6603 投资 6604 健康 6605 购房 6606 法律 6607 环保 6608 公益 6609 时装搭配 6610 汽车资讯 6611 生活资讯 6612 商业财经 6613 科技资讯 6614 娱乐八卦 6615 网络奇闻 6616 军事 6617 时尚 6618 NBA 6619 体育健身 67 球类运动 6701 休闲健身 6702 跑步骑行 6703 水上运动 6704 极限运动 6705 户外运动 6706 健身器械 6707 体育类赛事 6708 体育赛事票务 6709 "
str= str.split(" ")
let y = []
for(let i = 0;i<str.length-1;i+=2){
	y.push({
		name:str[i],
		id:str[i+1]
	})
}
console.log(y)
class Node{
  constructor(node,parent=null){
    this.id =node.id
    this.name = node.name
    this.children = []
  }
}
let newinterest = new Node({
	id:0,
	name:'全部'
})

for(let i = 0;i<y.length;i++){
	if(y[i].id < 100){
		 newinterest.children.push(new Node(y[i]))
	}else if(y[i].id > 100 && y[i].id < 10000){
		let j = Math.floor(y[i].id/100)
		for(let item of  newinterest.children){
			if(item.id == j){
				item.children.push(new Node(y[i]))
				break
			}
		}
	}else{
		let j = Math.floor(y[i].id/10000)
		for(let item of newinterest.children){
			if(item.id == j){
				let k = Math.floor(y[i].id/100)
				for(let it of item.children){
					if(it.id == k){
						it.children.push(new Node(y[i]))
						break
					}
				}
				break
			}
		}
	}
}
// JSON.stringify(newinterest)
console.log(JSON.stringify(newinterest))